doc/soap-examples/IBM/documentRepositoryProvideAndRegisterDocumentSetB/Request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:2d96988a-85ee-4403-a0df-b010e7b2d886</MessageID>
    <To xmlns="http://www.w3.org/2005/08/addressing">https://epa-as-1.dev.epa4all.de:443/epa/xds-document/api/I_Document_Management</To>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
  </soap:Header>
  <soap:Body>
    <ns5:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns6="urn:ihe:iti:rmd:2017">
      <ns4:SubmitObjectsRequest>
        <RegistryObjectList>
          <RegistryPackage objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage" id="submissionset">
            <Slot name="submissionTime">
              <ValueList>
                <Value>20241107191411</Value>
              </ValueList>
            </Slot>
            <Classification classifiedObject="submissionset" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="SubmissionSetClassification"/>
            <Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="submissionset" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="author">
              <Slot name="authorPerson">
                <ValueList>
                  <Value>123456667^LastName^FirstName^^^Prof. Dr.^^^&amp;1.2.276.0.76.4.16&amp;ISO</Value>
                </ValueList>
              </Slot>
              <Slot name="authorInstitution">
                <ValueList>
                  <Value>Unknown^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^5-SMC-B-Testkarte-883110000118001</Value>
                </ValueList>
              </Slot>
              <Slot name="authorRole">
                <ValueList>
                  <Value>8^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value>
                </ValueList>
              </Slot>
            </Classification>
            <ExternalIdentifier registryObject="submissionset" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="X110486750^^^&amp;1.2.276.0.76.4.8&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="patientId">
              <Name>
                <LocalizedString value="XDSSubmissionSet.patientId"/>
              </Name>
            </ExternalIdentifier>
            <ExternalIdentifier registryObject="submissionset" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="2.2512016812382728110974.17953743947351347054" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="uniqueId">
              <Name>
                <LocalizedString value="XDSSubmissionSet.uniqueId"/>
              </Name>
            </ExternalIdentifier>
          </RegistryPackage>
          <ExtrinsicObject mimeType="application/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" id="DocumentEntry-0">
            <Slot name="creationTime">
              <ValueList>
                <Value>20241105091854</Value>
              </ValueList>
            </Slot>
            <Slot name="languageCode">
              <ValueList>
                <Value>de-DE</Value>
              </ValueList>
            </Slot>
            <Slot name="URI">
              <ValueList>
                <Value>2.2512016812382728110974.17953743947351347054.xml</Value>
              </ValueList>
            </Slot>
            <Name>
              <LocalizedString xml:lang="de-DE" value="Dokument 2.2512016812382728110974.17953743947351347054"/>
            </Name>
            <Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="DocumentEntry-0" nodeRepresentation="ADM" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="class-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.3.6.1.4.1.19376.3.276.1.5.8</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Administratives Dokument"/>
              </Name>
            </Classification>
            <Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="DocumentEntry-0" nodeRepresentation="LEI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="confidentiality-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.2.276.0.76.5.491</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Dokument einer Leistungserbringerinstitution"/>
              </Name>
            </Classification>
            <Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="DocumentEntry-0" nodeRepresentation="urn:ihe:iti:xds:2017:mimeTypeSufficient" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="formatCode-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.3.6.1.4.1.19376.1.2.3</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Dokument mit mime-type"/>
              </Name>
            </Classification>
            <Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="DocumentEntry-0" nodeRepresentation="PRA" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="HealthCareFacilityTypeCode-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.3.6.1.4.1.19376.3.276.1.5.2</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Arztpraxis"/>
              </Name>
            </Classification>
            <Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="DocumentEntry-0" nodeRepresentation="PRA" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="author-0">
              <Slot name="authorPerson">
                <ValueList>
                  <Value>123456667^LastName^FirstName^^^Prof. Dr.^^^&amp;1.2.276.0.76.4.16&amp;ISO</Value>
                </ValueList>
              </Slot>
            </Classification>
            <Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="DocumentEntry-0" nodeRepresentation="ALLG" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="practiceSettingCode-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.3.6.1.4.1.19376.3.276.1.5.4</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Allgemeinmedizin"/>
              </Name>
            </Classification>
            <Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="DocumentEntry-0" nodeRepresentation="BERI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="typeCode-0">
              <Slot name="codingScheme">
                <ValueList>
                  <Value>1.3.6.1.4.1.19376.3.276.1.5.9</Value>
                </ValueList>
              </Slot>
              <Name>
                <LocalizedString xml:lang="de-DE" value="Arztbericht"/>
              </Name>
            </Classification>
            <ExternalIdentifier registryObject="DocumentEntry-0" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="X110486750^^^&amp;1.2.276.0.76.4.8&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="patient-0">
              <Name>
                <LocalizedString value="XDSDocumentEntry.patientId"/>
              </Name>
            </ExternalIdentifier>
            <ExternalIdentifier registryObject="DocumentEntry-0" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="2.2512016812382728110974.17953743947351347054" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="unique-0">
              <Name>
                <LocalizedString value="XDSDocumentEntry.uniqueId"/>
              </Name>
            </ExternalIdentifier>
          </ExtrinsicObject>
          <Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="submissionset" targetObject="DocumentEntry-0" id="association-0">
            <Slot name="SubmissionSetStatus">
              <ValueList>
                <Value>Original</Value>
              </ValueList>
            </Slot>
          </Association>
        </RegistryObjectList>
      </ns4:SubmitObjectsRequest>
      <ns5:Document id="DocumentEntry-0">
        <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:8f20d2fa-3d0b-4c72-b1c6-26e3e1b50ec5-3@urn%3Aihe%3Aiti%3Axds-b%3A2007"/>
      </ns5:Document>
    </ns5:ProvideAndRegisterDocumentSetRequest>
  </soap:Body>
</soap:Envelope>
